app/controllers/articles_controller.rb

  def create
    @article = Article.new({:title => params["title"], :body => params["body"]})
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "articles"], ["body", "articles"], ["created_at", "2016-02-23 03:20:06.563080"], ["updated_at", "2016-02-23 03:20:06.563080"]]

  def update
    @article = Article.find(params[:id])
    @article.update({:title => params[:title], :body => params[:body]})
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Second Article"], ["body", "Testing Updating"], ["updated_at", "2016-02-23 06:15:38.810911"], ["id", 2]]